ka2_2024/src/Documents/НачислениеЕНП/НачислениеЕНП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЕНП</name>
  <basedOn>Document.ПерерасчетИмущественныхНалогов</basedOn>
  <registerRecords>AccumulationRegister.РасчетыПоНалогамНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоСанкциямНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЕдиномуНалоговомуСчету</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительноеУведомлениеПоНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипНалога</name>
    <type>
      <types>EnumRef.УдалитьТипыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОкончаниеОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПерерасчетИмущественныхНалогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаНалогов</name>
    <attributes>
      <name>ТипНалога</name>
      <type>
        <types>CatalogRef.ВидыНалоговВзносов</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТипНалога</name>
      <type>
        <types>EnumRef.УдалитьТипыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьУведомление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Catalogs/ВидыНалоговВзносов/ВидыНалоговВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалоговВзносов</name>
  <predefined>
    <items>
      <name>ЕдиныйНалоговыйПлатеж</name>
      <description>Единый налоговый платеж</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>ЕНВД</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>ЕСХН</description>
    </items>
    <items>
      <name>ЗемельныйНалог</name>
      <description>Земельный налог</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество организаций</description>
    </items>
    <items>
      <name>НалогНаПрибыль_РегиональныйБюджет</name>
      <description>Налог на прибыль, региональный бюджет</description>
    </items>
    <items>
      <name>НалогНаПрибыль_ФедеральныйБюджет</name>
      <description>Налог на прибыль, федеральный бюджет</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>НДС_ВвозимыеТовары</name>
      <description>НДС при импорте товаров из ЕАЭС</description>
    </items>
    <items>
      <name>НДС_НалоговыйАгент</name>
      <description>НДС при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ_ИП</name>
      <description>НДФЛ индивидуального предпринимателя </description>
    </items>
    <items>
      <name>ПрочиеНалогиИСборы</name>
      <description>Прочие налоги и сборы</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ТранспортныйНалог</name>
      <description>Транспортный налог организаций</description>
    </items>
    <items>
      <name>УСН_Доходы</name>
      <description>Налог при УСН (доходы)</description>
    </items>
    <items>
      <name>УСН_ДоходыМинусРасходы</name>
      <description>Налог при УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>УСН_МинимальныйНалог</name>
      <description>Минимальный налог УСН</description>
    </items>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>ПФР - по суммарному тарифу с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРСтраховаяЧасть</name>
      <description>Страховые взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительнаяЧасть</name>
      <description>Страховые взносы в ПФР, накопительная часть (до 2014 г.)</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифЛЭ</name>
      <description>Взносы на выплату доплат к пенсии членам летных экипажей</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифШахтеры</name>
      <description>Взносы в ПФР (дополнительный тариф шахтеров)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)</description>
    </items>
    <items>
      <name>ПФРСПревышения</name>
      <description>ПФР - с базы сверх предельной величины, с 1 января 2016 года</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>ТФОМС</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССНС</name>
      <description>Страховые взносы от несчастных случаев</description>
    </items>
    <items>
      <name>НДФЛДоходыКонтрагентов</name>
      <description>НДФЛ с доходов контрагентов</description>
    </items>
    <items>
      <name>НДФЛДивиденды</name>
      <description>НДФЛ с дивидендов</description>
    </items>
    <items>
      <name>НДФЛДивидендыСотрудникам</name>
      <description>НДФЛ с дивидендов работникам</description>
    </items>
    <items>
      <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
      <description>НДФЛ, доначисленный по результатам проверки</description>
    </items>
    <items>
      <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
      <description>НДФЛ передача задолженности в налоговый орган</description>
    </items>
    <items>
      <name>НДФЛПрочиеРасчетыСПерсоналом</name>
      <description>НДФЛ с доходов по прочим операциям с персоналом</description>
    </items>
    <items>
      <name>НДФЛСПревышения</name>
      <description>НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>НДФЛДивидендыСПревышения</name>
      <description>НДФЛ с дивидендов свыше предельной величины</description>
    </items>
    <items>
      <name>ПФРДоПредельнойВеличины</name>
      <description>ПФР - с базы до предельной величины</description>
    </items>
    <items>
      <name>НДС_ОбратноеОбложение</name>
      <description>НДС налогового агента по отдельным видам товаров</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Налог при АУСН</description>
    </items>
    <items>
      <name>СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы по единому тарифу</description>
    </items>
    <items>
      <name>ОПСИностранныхРаботников</name>
      <description>Взносы на пенсионное страхование иностранных работников</description>
    </items>
    <items>
      <name>ОМСИностранныхРаботников</name>
      <description>Взносы на медицинское страхование иностранных работников</description>
    </items>
    <items>
      <name>ОССИностранныхРаботников</name>
      <description>Взносы на социальное страхование иностранных работников</description>
    </items>
    <items>
      <name>НалогНаПрибыль_НалоговыйАгент</name>
      <description>Налог на прибыль при исполнении обязанностей налогового агента</description>
    </items>
  </predefined>
  <attributes>
    <name>ПлательщикСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/Documents/НачислениеЕНП/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ИспользоватьНачислениеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты");
	Элементы.РасшифровкаНалоговПодменюЗаполнить.Видимость = ИспользоватьНачислениеЗарплаты;
	Элементы.РасшифровкаНалоговЗаполнить.Видимость = Не ИспользоватьНачислениеЗарплаты;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПредварительноеУведомлениеПоНДФЛ = ДанныеПервойПоловиныПериодаПоНДФЛ;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьСубконто();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПлатежиВБюджетКлиентСервер.ДействуетФедеральныйЗакон263ФЗ(Объект.Дата) Тогда
		ДанныеВыбора = ОрганизацииПлательщикиЕНП();
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Организация = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.РасшифровкаНалогов.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект, ВыбранноеЗначение),
			НСтр("ru = 'Таблица расшифровки будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОрганизацияПриИзмененииЗавершение(КодВозвратаДиалога.Да, ВыбранноеЗначение)
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПервойПоловиныПериодаПоНДФЛПриИзменении(Элемент)
	
	Если НЕ ДанныеПервойПоловиныПериодаПоНДФЛ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДокументЗаПервуюПоловинуПериодаПоНДФЛ(Объект.Дата) Тогда
		
		ТекстСообщения = НСтр("ru = 'Регистрация начислений по НДФЛ за первую половину периода возможна только до 12 числа текущего месяца.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Дата", "Объект");
		
		ДанныеПервойПоловиныПериодаПоНДФЛ = Ложь;
		
	КонецЕсли;
	
	Если НЕ ТаблицаСодержитСведенияТолькоПоНДФЛ(Объект.РасшифровкаНалогов) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для установки флага ""Данные по НДФЛ за первую половину периода""
		|в табличной части документа необходимо оставить только сведения об удержанном НДФЛ.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "РасшифровкаНалогов", "Объект");
		
		ДанныеПервойПоловиныПериодаПоНДФЛ = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаНалогов

&НаКлиенте
Процедура РасшифровкаНалоговОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Источник", "ПоДаннымДекларацийИРасчетов");
	ПараметрыЗаполнения.Вставить("ТипыНалогов", ВыбранноеЗначение);
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.РасшифровкаНалоговПредставлениеПериода Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
		РасшифровкаНалоговВыборОтчетногоПериода(ОписаниеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.РасшифровкаНалогов.ТекущиеДанные;
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"РасшифровкаНалоговСубконто1", "РасшифровкаНалоговСубконто2", "РасшифровкаНалоговСубконто3");
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(ТекущиеДанные.СчетУчета, ЭтотОбъект, ПоляФормы, Неопределено, Истина);
	
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	Если НоваяСтрока Тогда
		ОписаниеСтроки.ФормироватьУведомление = Истина;
		Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
			ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
			ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки);
			ЗаполнитьСрокУплаты(ОписаниеСтроки);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Элементы.РасшифровкаНалогов.ТекущиеДанные, ОписаниеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговТипНалогаПриИзменении(Элемент)
	
	ОписаниеСтроки = ОписаниеТекущейСтрокиДокумента();
	Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
		ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
		ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки);
	КонецЕсли;
	
	РасшифровкаНалоговТипНалогаПриИзмененииНаСервере(ОписаниеСтроки);
	
	ТекущиеДанные = Элементы.РасшифровкаНалогов.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ОписаниеСтроки);
	ОбработатьИзменениеСчетаУчета(ЭтотОбъект, ТекущиеДанные);
	
	РасшифровкаНалоговУточнитьКБК(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаНалоговТипНалогаПриИзмененииНаСервере(ОписаниеСтроки)
	
	Если ЕдиныйНалоговыйСчетПовтИсп.ВидыНалоговУплачиваемыеБезУведомлений().Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		ОписаниеСтроки.ФормироватьУведомление = Ложь;
	КонецЕсли;
	
	ОписаниеСтроки.СчетУчета = РеглУчетСервер.СчетУчетаПоТипуНалога(ОписаниеСтроки.ТипНалога);
	ОписаниеСтроки.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ОписаниеСтроки.СчетУчета);
	
	ИндексСубконто = ДанныеСчета.ИдентификаторыСубконто[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет];
	Если ИндексСубконто <> Неопределено Тогда
		ОписаниеСтроки["Субконто" + ИндексСубконто] = ОписаниеСтроки.ВидПлатежаВБюджет;
	КонецЕсли;
	
	ИндексСубконто = ДанныеСчета.ИдентификаторыСубконто[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.УровниБюджетов];
	Если ИндексСубконто <> Неопределено Тогда
		Если ОписаниеСтроки.ТипНалога = Справочники.ВидыНалоговВзносов.НалогНаПрибыль_ФедеральныйБюджет Тогда
			ОписаниеСтроки["Субконто" + ИндексСубконто] = Перечисления.УровниБюджетов.ФедеральныйБюджет;
		ИначеЕсли ОписаниеСтроки.ТипНалога = Справочники.ВидыНалоговВзносов.НалогНаПрибыль_РегиональныйБюджет Тогда
			ОписаниеСтроки["Субконто" + ИндексСубконто] = Перечисления.УровниБюджетов.РегиональныйБюджет;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСрокУплаты(ОписаниеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСчетУчетаПриИзменении(Элемент)
	ОбработатьИзменениеСчетаУчета(ЭтотОбъект, Элементы.РасшифровкаНалогов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто1ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, Элементы.РасшифровкаНалогов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РасшифровкаНалоговСубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, "1", СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто2ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, Элементы.РасшифровкаНалогов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто2ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РасшифровкаНалоговСубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, "2", СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто3ПриИзменении(Элемент)
	ИзменитьПараметрыВыбораПолейСубконто(ЭтотОбъект, Элементы.РасшифровкаНалогов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконто3ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РасшифровкаНалоговСубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, "3", СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоДаннымЗарплаты(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Источник", "ПоДаннымЗарплаты");
	
	Если ДанныеПервойПоловиныПериодаПоНДФЛ Тогда
		ПараметрыЗаполнения.Вставить("ДанныеПервойПоловиныПериодаПоНДФЛ", Истина);
	КонецЕсли;
	
	Если Объект.РасшифровкаНалогов.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнение", ЭтотОбъект, ПараметрыЗаполнения),
			НСтр("ru = 'Таблица расшифровки будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымДекларацийИРасчетов(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Источник", "ПоДаннымДекларацийИРасчетов");
	
	Если Объект.РасшифровкаНалогов.Количество() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьЗаполнение", ЭтотОбъект, ПараметрыЗаполнения),
			НСтр("ru = 'Таблица расшифровки будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДатаОстатков", Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",  Объект.Организация);
	
	ОткрытьФорму("Документ.НачислениеЕНП.Форма.ФормаПодбораНалогов",
		ПараметрыПодбора, Элементы.РасшифровкаНалогов);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НачалоПримененияЕНС = ЕдиныйНалоговыйСчет.ДатаНачалаПрименения();
	ДатаВступленияВСилу539ФЗ = ЕдиныйНалоговыйСчет.ДатаВступленияВСилу539ФЗ();
	
	НалогиУплачиваемыеЕжемесячно = ЕдиныйНалоговыйСчетПовтИсп.НалогиУплачиваемыеЕжемесячно();
	НалогиУплачиваемыеПоквартально = ЕдиныйНалоговыйСчетПовтИсп.НалогиУплачиваемыеПоквартально();
	
	ВидыНалогаПрибыль = ЕдиныйНалоговыйСчетПовтИсп.ВидыНалоговНаПрибыль();
	ВидыНалогаАгентскийНДФЛ = ЕдиныйНалоговыйСчетПовтИсп.ВидыНалоговНДФЛНалоговогоАгента();
	
	СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(Объект.Дата);
	
	ПорядокУплатыАвансовПоНалогуНаПрибыль = ПорядокУплатыАвансовПоНалогуНаПрибыль(Объект.Организация, Объект.Дата);
	
	ДанныеПервойПоловиныПериодаПоНДФЛ = Объект.ПредварительноеУведомлениеПоНДФЛ;
	Если Не ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ(Объект.Дата) Тогда
		Элементы.ДанныеПервойПоловиныПериодаПоНДФЛ.Видимость = ДанныеПервойПоловиныПериодаПоНДФЛ;
		Элементы.ДанныеПервойПоловиныПериодаПоНДФЛ.Доступность = Ложь;
	КонецЕсли;
	
	ТипыСвязанныеСОрганизацией = НастройкаСчетовУчетаСервер.ТипыСвязанныеСОрганизацией();
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	ЗаполнитьДобавленныеКолонкиТаблицы();
	
	УстановитьДоступностьСубконто();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(Объект.Дата);
	
	ПорядокУплатыАвансовПоНалогуНаПрибыль = ПорядокУплатыАвансовПоНалогуНаПрибыль(Объект.Организация, Объект.Дата);
	
	ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ = ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ(Объект.Дата);
	
	Элементы.ДанныеПервойПоловиныПериодаПоНДФЛ.Доступность = ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ;
	Элементы.ДанныеПервойПоловиныПериодаПоНДФЛ.Видимость = ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ;
	
	Если Не ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ Тогда
		ДанныеПервойПоловиныПериодаПоНДФЛ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Представление отчетного периода
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаНалоговПредставлениеПериода");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.РасшифровкаНалогов.ПредставлениеПериода", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Заполнить>'"));
	
	Для Индекс = 1 По 3 Цикл
		
		// Подсказка субконто
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["РасшифровкаНалоговСубконто" + Индекс].Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РасшифровкаНалогов.Субконто" + Индекс + "Доступность");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РасшифровкаНалогов.Субконто" + Индекс);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НеЗаполненноеСубконто);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<...>");
		
		// Доступность субконто
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["РасшифровкаНалоговСубконто" + Индекс].Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РасшифровкаНалогов.Субконто" + Индекс + "Доступность");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РасшифровкаНалогов.Субконто" + Индекс);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	КонецЦикла;
	
	//
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблицы()
	
	Для Каждого СтрокаТаблицы Из Объект.РасшифровкаНалогов Цикл
		ОписаниеСтроки = ОписаниеСтрокиДокумента(СтрокаТаблицы);
		ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки);
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетУчета);
		ИндексСубконто = ДанныеСчета.ИдентификаторыСубконто[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет];
		Если ИндексСубконто <> Неопределено Тогда
			ОписаниеСтроки.ВидПлатежаВБюджет = СтрокаТаблицы["Субконто" + ИндексСубконто];
		Иначе
			ОписаниеСтроки.ВидПлатежаВБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОписаниеСтроки, "ПредставлениеПериода, ВидПлатежаВБюджет");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСубконто()
	
	Для каждого СтрокаТаблицы Из Объект.РасшифровкаНалогов Цикл
		
		ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", "Субконто1", "Субконто2", "Субконто3");
		БухгалтерскийУчетКлиентСервер.УстановитьДоступностьСубконто(СтрокаТаблицы.СчетУчета, СтрокаТаблицы, ПоляОбъекта);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеТекущейСтрокиДокумента()
	
	ТекущиеДанные = Элементы.РасшифровкаНалогов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеСтроки = Новый Структура("ТипНалога, КодБК, Сумма,
		|НачалоПериода, КонецПериода, ПредставлениеПериода,
		|СчетУчета, Субконто1, Субконто2, Субконто3, ВидПлатежаВБюджет,
		|СрокУплаты, ФормироватьУведомление");
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки, ТекущиеДанные);
	ОписаниеСтроки.КонецПериода = КонецДня(ТекущиеДанные.КонецПериода);
	
	ОписаниеСтроки.Вставить("ЭтоАгентскийНДФЛ",
		ВидыНалогаАгентскийНДФЛ.Найти(ТекущиеДанные.ТипНалога) <> Неопределено);
	ОписаниеСтроки.Вставить("ЭтоНалогНаПрибыль",
		ВидыНалогаПрибыль.Найти(ТекущиеДанные.ТипНалога) <> Неопределено);
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		ОписаниеСтроки.Вставить("ПорядокУплатыАвансовПоНалогуНаПрибыль", ПорядокУплатыАвансовПоНалогуНаПрибыль);
	КонецЕсли;
	
	ОписаниеСтроки.Вставить("Идентификатор", ТекущиеДанные.ПолучитьИдентификатор());
	
	Возврат ОписаниеСтроки;
	
КонецФункции

&НаСервере
Функция ОписаниеСтрокиДокумента(СтрокаТаблицы)
	
	ОписаниеСтроки = Новый Структура("ТипНалога, КодБК, Сумма,
		|НачалоПериода, КонецПериода, ПредставлениеПериода,
		|СчетУчета, Субконто1, Субконто2, Субконто3, ВидПлатежаВБюджет,
		|СрокУплаты, ФормироватьУведомление");
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки, СтрокаТаблицы);
	ОписаниеСтроки.КонецПериода = КонецДня(СтрокаТаблицы.КонецПериода);
	
	ОписаниеСтроки.Вставить("ЭтоАгентскийНДФЛ",
		ВидыНалогаАгентскийНДФЛ.Найти(СтрокаТаблицы.ТипНалога) <> Неопределено);
	ОписаниеСтроки.Вставить("ЭтоНалогНаПрибыль",
		ВидыНалогаПрибыль.Найти(СтрокаТаблицы.ТипНалога) <> Неопределено);
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		ОписаниеСтроки.Вставить("ПорядокУплатыАвансовПоНалогуНаПрибыль", ПорядокУплатыАвансовПоНалогуНаПрибыль);
	КонецЕсли;
	
	ОписаниеСтроки.Вставить("Идентификатор", СтрокаТаблицы.ПолучитьИдентификатор());
	
	Возврат ОписаниеСтроки;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьЗаполнение(Ответ, ПараметрыЗаполнения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаНалогов.Очистить();
	
	ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьЗаполнениеНаСервере(ПараметрыЗаполнения)
	
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Ссылка", Объект.Ссылка);
	
	ЗаполнитьНаСервере(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ПараметрыЗаполнения)
	
	Если ПараметрыЗаполнения.Источник = "ПоДаннымЗарплаты" Тогда
		ТаблицаНалогов = Документы.НачислениеЕНП.ПолучитьНалогиПоДаннымЗарплаты(ПараметрыЗаполнения);
	Иначе
		ТаблицаНалогов = Документы.НачислениеЕНП.ПолучитьНалогиПоДаннымДекларацийИРасчетов(ПараметрыЗаполнения);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаНалогов Цикл
		НоваяСтрока = Объект.РасшифровкаНалогов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ОбработатьИзменениеСчетаУчета(ЭтотОбъект, НоваяСтрока);
		ОписаниеСтроки = ОписаниеСтрокиДокумента(НоваяСтрока);
		ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеСтроки);
		НоваяСтрока.ФормироватьУведомление =
			ВидыНалогаАгентскийНДФЛ.Найти(СтрокаТаблицы.ТипНалога) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеСчетаУчета(Форма, СтрокаТаблицы)
	
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"РасшифровкаНалоговСубконто1", "РасшифровкаНалоговСубконто2", "РасшифровкаНалоговСубконто3");
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(СтрокаТаблицы.СчетУчета, Форма, ПоляФормы, Неопределено, Истина);
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", "Субконто1", "Субконто2", "Субконто3");
	ПоляОбъекта.Вставить("Организация", Форма.Объект.Организация);
	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаТаблицы["СчетУчета"], СтрокаТаблицы, ПоляОбъекта, Истина);
	
	ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаТаблицы)
	
	ПараметрыДокумента = НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(Форма.Объект.Организация, СтрокаТаблицы, "Субконто%Индекс%", "СчетУчета");
	НастройкаСчетовУчетаКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(
		Форма, СтрокаТаблицы, "Субконто%Индекс%", "РасшифровкаНалоговСубконто%Индекс%", ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораСубконто(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные      = Элементы.РасшифровкаНалогов.ТекущиеДанные;
	ПараметрыДокумента = НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(Объект.Организация, ТекущиеДанные, "Субконто%Индекс%", "СчетУчета");
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтотОбъект, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговСубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, НомерСубконто, СтандартнаяОбработка)
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	
	ТекущиеДанные = Элементы.РасшифровкаНалогов.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет") Тогда
		ТекущиеДанные.ВидПлатежаВБюджет = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацииПлательщикиЕНП()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Организация КАК Организация
	|ИЗ РегистрСведений.НастройкиСистемыНалогообложения
	|ГДЕ ПлательщикЕНП";
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.ЗагрузитьЗначения(
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(Ответ, РезультатВыбора) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаНалогов.Очистить();
	Объект.Организация = РезультатВыбора;
	
	ПорядокУплатыАвансовПоНалогуНаПрибыль = ПорядокУплатыАвансовПоНалогуНаПрибыль(Объект.Организация, Объект.Дата);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговУточнитьКБК(ТекущиеДанные)
	
	КБКПоВидуНалога = СтатьиДоходовБюджетаРФ.Получить(ТекущиеДанные.ТипНалога);
	Если Не ЗначениеЗаполнено(КБКПоВидуНалога) Тогда
		ТекущиеДанные.КодБК = "";
		Возврат;
	КонецЕсли;
	
	Если КБКПоВидуНалога.Количество() > 1 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаНалоговУточнитьКБКЗавершение", ЭтотОбъект, ТекущиеДанные);
		ПоказатьВыборИзСписка(ОписаниеОповещения, КБКПоВидуНалога, Элементы.РасшифровкаНалоговКодБК);
	Иначе
		РасшифровкаНалоговУточнитьКБКЗавершение(КБКПоВидуНалога.Получить(0), ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговУточнитьКБКЗавершение(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КБК = Результат.Значение;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидПлатежаВБюджет) Тогда
		ТекущиеДанные.ВидПлатежаВБюджет = ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.Налог");
	КонецЕсли;
	
	КБКПоВидуПлатежа = "";
	Для Каждого ПодвидДохода Из КБК.ПодвидыДохода Цикл
		Если ПодвидДохода.Значение.ВидПлатежа = ТекущиеДанные.ВидПлатежаВБюджет Тогда
			КБКПоВидуПлатежа = КБК.Администратор + КБК.ВидДохода + ПодвидДохода.Ключ + КБК.КОСГУ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.КодБК = КБКПоВидуПлатежа;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговВыборОтчетногоПериода(ОписаниеСтроки)
	
	ПараметрыВыбораПериода = Новый Структура("НачалоПериода, КонецПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыВыбораПериода, ОписаниеСтроки);
	
	ПараметрыВыбораПериода.Вставить("МинимальныйПериод",
		НачалоГода(ДобавитьМесяц(НачалоПримененияЕНС, -1)));
	ПараметрыВыбораПериода.Вставить("ОграничениеСнизу", ПараметрыВыбораПериода.МинимальныйПериод);
	
	ИмяФормыПериода = "ОбщаяФорма.ВыборСтандартногоПериодаМесяц";
	Если НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		ИмяФормыПериода = "ОбщаяФорма.ВыборСтандартногоПериодаКвартал";
	ИначеЕсли НалогиУплачиваемыеЕжемесячно.Найти(ОписаниеСтроки.ТипНалога) = Неопределено Тогда
		ПараметрыВыбораПериода.Вставить("ВыборКварталов", Истина);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаНалоговПроверитьВыборОтчетногоПериода", ЭтотОбъект, ОписаниеСтроки);
	ОткрытьФорму(ИмяФормыПериода, ПараметрыВыбораПериода, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговПроверитьВыборОтчетногоПериода(Результат, ОписаниеСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПериодов = Новый СписокЗначений;
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		
		Результат.НачалоПериода = НачалоГода(Результат.НачалоПериода);
		
		ОтчетныйПериод = СписокПериодов.Добавить(Результат,
			ПредставлениеПериода(Результат.НачалоПериода, Результат.КонецПериода));
		
	ИначеЕсли Не ОписаниеСтроки.ЭтоАгентскийНДФЛ Тогда
		
		ОтчетныйПериод = СписокПериодов.Добавить(Результат,
			ПредставлениеПериода(Результат.НачалоПериода, Результат.КонецПериода));
		
	ИначеЕсли Результат.НачалоПериода >= ДатаВступленияВСилу539ФЗ Тогда
		
		// НДФЛ налогового агента с 01.01.2024 года
		
		ГраницаПериодов = Результат.НачалоПериода + 22 * 86400; // 23-е число текущего месяца
		
		ПерваяПоловина = Новый Структура("НачалоПериода, КонецПериода", Результат.НачалоПериода, ГраницаПериодов - 1);
		ВтораяПоловина = Новый Структура("НачалоПериода, КонецПериода", ГраницаПериодов, Результат.КонецПериода);
		
		ПараметрыПредставлений = Новый Структура("МесяцПрописью, ПерваяПоловина, ВтораяПоловина");
		ПараметрыПредставлений.МесяцПрописью = 
			Сред(Формат(Результат.НачалоПериода, НСтр("ru = 'ДФ=''д ММММ'''")), 3); // Например - "1 февраля" -> "февраля"
		ПараметрыПредставлений.ПерваяПоловина = СтрШаблон(НСтр("ru = 'до %1'"), Формат(ГраницаПериодов, "ДЛФ=Д"));
		ПараметрыПредставлений.ВтораяПоловина = ПредставлениеПериода(ГраницаПериодов, Результат.КонецПериода);
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ПерваяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Начало [МесяцПрописью]: [ПерваяПоловина]'"),
				ПараметрыПредставлений));
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ВтораяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Конец [МесяцПрописью]: [ВтораяПоловина]'"),
				ПараметрыПредставлений));
		
	ИначеЕсли Результат.КонецПериода = КонецГода(Результат.КонецПериода) Тогда
		
		// НДФЛ налогового агента - в декабре
		
		ГраницаПериодов = Результат.НачалоПериода + 22 * 86400; // 23-е декабря
		
		ПерваяПоловина = Новый Структура("НачалоПериода, КонецПериода", Результат.НачалоПериода, Результат.КонецПериода);
		ВтораяПоловина = Новый Структура("НачалоПериода, КонецПериода", ГраницаПериодов, Результат.КонецПериода);
		
		ПараметрыПредставлений = Новый Структура("МесяцПрописью, ПерваяПоловина, ВтораяПоловина");
		ПараметрыПредставлений.МесяцПрописью = 
			Сред(Формат(Результат.НачалоПериода, НСтр("ru = 'ДФ=''д ММММ'''")), 3); // Например - "1 декабря" -> "декабря"
		ПараметрыПредставлений.ПерваяПоловина = СтрШаблон(НСтр("ru = 'до %1'"), Формат(ГраницаПериодов, "ДЛФ=Д"));
		ПараметрыПредставлений.ВтораяПоловина = ПредставлениеПериода(ГраницаПериодов, Результат.КонецПериода);
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ПерваяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Начало [МесяцПрописью]: [ПерваяПоловина]'"),
				ПараметрыПредставлений));
		
		ОтчетныйПериод = СписокПериодов.Добавить(
			ВтораяПоловина, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
				НСтр("ru = 'Конец [МесяцПрописью]: [ВтораяПоловина]'"),
				ПараметрыПредставлений));
		
	Иначе
		
		// НДФЛ налогового агента
		
		ОтчетныйПериод = СписокПериодов.Добавить(Результат,
			ПредставлениеПериода(Результат.НачалоПериода, Результат.КонецПериода));
		
		Если Результат.КонецПериода = КонецГода(Результат.КонецПериода) Тогда
			ГраницаПериода = Результат.НачалоПериода + 22 * 86400; // 23-е декабря
			ОтчетныйПериод = СписокПериодов.Добавить(
				Новый Структура("НачалоПериода, КонецПериода", ГраницаПериода, Результат.КонецПериода),
				ПредставлениеПериода(ГраницаПериода, Результат.КонецПериода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокПериодов.Количество() > 1 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РасшифровкаНалоговВыборОтчетногоПериодаЗавершение", ЭтотОбъект, ОписаниеСтроки);
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокПериодов, Элементы.РасшифровкаНалоговПредставлениеПериода);
		
	ИначеЕсли СписокПериодов.Количество() = 1 Тогда
		
		РасшифровкаНалоговВыборОтчетногоПериодаЗавершение(ОтчетныйПериод, ОписаниеСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНалоговВыборОтчетногоПериодаЗавершение(Результат, ОписаниеСтроки) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки, Результат.Значение);
	Если Не ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки) Тогда
		ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки);
	КонецЕсли;
	
	ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки);
	ЗаполнитьСрокУплаты(ОписаниеСтроки);
	
	ЗаполнитьЗначенияСвойств(Элементы.РасшифровкаНалогов.ТекущиеДанные, ОписаниеСтроки);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеОтчетногоПериода(ОписаниеСтроки)
	
	Если Не ЗначениеЗаполнено(ОписаниеСтроки.НачалоПериода)
		ИЛИ Не ЗначениеЗаполнено(ОписаниеСтроки.КонецПериода) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ОписаниеСтроки.НачалоПериода);
	КонецПериода  = КонецДня(ОписаниеСтроки.КонецПериода);
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль И ОписаниеСтроки.ПорядокУплатыАвансовПоНалогуНаПрибыль =
		ПредопределенноеЗначение("Перечисление.ПорядокУплатыАвансовПоНалогуНаПрибыль.ПоФактическойПрибыли") Тогда
		ОписаниеСтроки.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, КонецПериода, "ФП=Ложь");
	Иначе
		ОписаниеСтроки.ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, КонецПериода, "ФП=Истина");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокУплаты(ОписаниеСтроки)
	
	НачалоПериода = ОписаниеСтроки.НачалоПериода;
	КонецПериода  = ОписаниеСтроки.КонецПериода;
	
	Если ОписаниеСтроки.ЭтоАгентскийНДФЛ Тогда
		
		Если НачалоПериода > НачалоМесяца(НачалоПериода) И КонецПериода = КонецМесяца(КонецПериода)
			И КонецПериода <> КонецГода(КонецПериода) Тогда
			
			// Вторая половина месяца (кроме декабря) - уплата 5-го числа следующего месяца
			МесяцПлатежа = ДобавитьМесяц(КонецПериода, 1);
			РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 5);
			
		ИначеЕсли КонецПериода = КонецГода(КонецПериода) И НачалоПериода > НачалоМесяца(НачалоПериода) Тогда
			
			// Вторая половина декабря- уплата 31-го декабря
			РасчетныйСрокУплаты = НачалоДня(КонецГода(КонецПериода));
			
		Иначе
			
			// Первая половина месяца - уплата 28-го числа текущего месяца
			РасчетныйСрокУплаты = Дата(Год(КонецПериода), Месяц(КонецПериода), 28);
			
		КонецЕсли;
		
	ИначеЕсли ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		
		Если ПорядокУплатыАвансовПоНалогуНаПрибыль = Перечисления.ПорядокУплатыАвансовПоНалогуНаПрибыль.Ежеквартально 
			ИЛИ ПорядокУплатыАвансовПоНалогуНаПрибыль = Перечисления.ПорядокУплатыАвансовПоНалогуНаПрибыль.Ежемесячно Тогда
			
			
			//МесяцПлатежа = ДобавитьМесяц(КонецПериода, -2);    
			МесяцПлатежа = Объект.Дата;
			
			РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 28);
			
		ИначеЕсли ПорядокУплатыАвансовПоНалогуНаПрибыль = Перечисления.ПорядокУплатыАвансовПоНалогуНаПрибыль.ПоФактическойПрибыли Тогда
			
			//МесяцПлатежа = ДобавитьМесяц(КонецПериода, 1);  
			МесяцПлатежа = Объект.Дата;
			РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 28);
			
		КонецЕсли; 		
	Иначе
		// Общий порядок - уплата 28-го числа следующего месяца
		МесяцПлатежа = ДобавитьМесяц(КонецПериода, 1);
		РасчетныйСрокУплаты = Дата(Год(МесяцПлатежа), Месяц(МесяцПлатежа), 28);
		
	КонецЕсли;
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ПараметрыПолученияБлижайшихРабочихДат =
		КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(ПроизводственныйКалендарь);
	ПараметрыПолученияБлижайшихРабочихДат.ВызыватьИсключение = Ложь;
	Если ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецДня(РасчетныйСрокУплаты) = КонецГода(КонецПериода) Тогда
		ПараметрыПолученияБлижайшихРабочихДат.ПолучатьПредшествующие = Истина;
	КонецЕсли;
	
	ГрафикПереноса = КалендарныеГрафики.БлижайшиеРабочиеДаты(
		КалендарныеГрафики.ОсновнойПроизводственныйКалендарь(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РасчетныйСрокУплаты),
		ПараметрыПолученияБлижайшихРабочихДат);
	
	Если ГрафикПереноса[РасчетныйСрокУплаты] <> Неопределено Тогда
		ОписаниеСтроки.СрокУплаты = ГрафикПереноса[РасчетныйСрокУплаты];
	Иначе
		ОписаниеСтроки.СрокУплаты = РасчетныйСрокУплаты;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Не удалось определить ближайшую рабочую дату для даты %1, возможно, производственный календарь не заполнен.'"),
			Формат(РасчетныйСрокУплаты, "ДЛФ=D")));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаОтправкаПредварительныхУведомленийПоНДФЛ(Знач ДатаДокумента)
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ДатаДокумента < ЕдиныйНалоговыйСчет.ДатаВступленияВСилу539ФЗ()
		И ДатаДокумента >= УчетНДФЛ.НачалоПередачиЧастичныхУведомлений();
	
КонецФункции

&НаКлиенте
Функция ДокументЗаПервуюПоловинуПериодаПоНДФЛ(Знач ДатаДокумента)
	Возврат День(ДатаДокумента) <= 12;
КонецФункции

&НаКлиенте
Функция ТаблицаСодержитСведенияТолькоПоНДФЛ(ТаблицаНалогов)
	
	Для Каждого СтрокаТаблицы Из ТаблицаНалогов Цикл
		Если ВидыНалогаАгентскийНДФЛ.Найти(СтрокаТаблицы.ТипНалога) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеОтчетногоПериода(ОписаниеСтроки)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеСтроки.НачалоПериода)
		ИЛИ НЕ ЗначениеЗаполнено(ОписаниеСтроки.КонецПериода) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ОписаниеСтроки.НачалоПериода);
	КонецПериода  = КонецДня(ОписаниеСтроки.КонецПериода);
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		
		ПоФактическойПрибыли = ОписаниеСтроки.ПорядокУплатыАвансовПоНалогуНаПрибыль =
			ПредопределенноеЗначение("Перечисление.ПорядокУплатыАвансовПоНалогуНаПрибыль.ПоФактическойПрибыли");
		
		Возврат НачалоПериода = НачалоГода(НачалоПериода)
			И НачалоПериода = НачалоГода(КонецПериода)
			И ((ПоФактическойПрибыли И КонецПериода = КонецМесяца(КонецПериода))
				ИЛИ КонецПериода = КонецКвартала(КонецПериода));
		
	ИначеЕсли НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		Возврат НачалоКвартала(НачалоПериода) = НачалоКвартала(КонецПериода) // Начало и конец периода в одном квартале
			И НачалоПериода = НачалоКвартала(НачалоПериода) // Начало периода соответствует началу квартала
			И КонецПериода = КонецКвартала(КонецПериода); // Конец периода соответствует концу квартала
		
	ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И НачалоПериода >= ДатаВступленияВСилу539ФЗ Тогда
		
		Возврат НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) // Начало и окончание периода в одном месяце
			И ((НачалоПериода = НачалоМесяца(НачалоПериода) И День(КонецПериода) = 22) // С начала месяца по 22-е число
				ИЛИ (День(НачалоПериода) = 23) И КонецПериода = КонецМесяца(КонецПериода)); // С 23-го числа по конец месяца
		
	ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецПериода = КонецГода(КонецПериода) Тогда
		
		Возврат НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода) // Начало и окончание периода в одном месяце
			И (НачалоПериода = НачалоМесяца(НачалоПериода) // Полный месяц декабрь
				ИЛИ День(НачалоПериода) = 23); // Или с 23-го декабря по конец года
		
	ИначеЕсли НалогиУплачиваемыеЕжемесячно.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		Возврат НачалоПериода = НачалоМесяца(КонецПериода)
			И НачалоПериода = НачалоМесяца(НачалоПериода)
			И КонецПериода = КонецМесяца(КонецПериода);
		
	Иначе
		
		Возврат НачалоПериода <= НачалоМесяца(КонецПериода)
			И НачалоПериода = НачалоМесяца(НачалоПериода)
			И КонецПериода = КонецМесяца(КонецПериода);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОтчетныйПериодПоУмолчанию(ОписаниеСтроки)
	
	ОтчетныйПериод = Объект.Дата;
	
	Если ОписаниеСтроки.ЭтоНалогНаПрибыль Тогда
		
		НачалоПериода = НачалоГода(ОтчетныйПериод);
		КонецПериода  = КонецКвартала(ОтчетныйПериод);
		
		Если ОписаниеСтроки.ПорядокУплатыАвансовПоНалогуНаПрибыль =
			ПредопределенноеЗначение("Перечисление.ПорядокУплатыАвансовПоНалогуНаПрибыль.ПоФактическойПрибыли") Тогда
			
			КонецПериода = КонецМесяца(ОтчетныйПериод);
			
		КонецЕсли;
		
	ИначеЕсли НалогиУплачиваемыеПоквартально.Найти(ОписаниеСтроки.ТипНалога) <> Неопределено Тогда
		
		НачалоПериода = НачалоКвартала(ОтчетныйПериод);
		КонецПериода  = КонецКвартала(ОтчетныйПериод);
		
	Иначе
		
		НачалоПериода = НачалоМесяца(ОтчетныйПериод);
		КонецПериода  = КонецМесяца(ОтчетныйПериод);
		
		Если ОписаниеСтроки.ЭтоАгентскийНДФЛ И НачалоПериода >= ДатаВступленияВСилу539ФЗ Тогда
			
			ГраницаПериодов = НачалоПериода + 22 * 86400; // 23-е число отчетного месяца
			Если Объект.Дата >= ГраницаПериодов Тогда
				НачалоПериода = ГраницаПериодов; // С 23-го числа по последнее число отчетного месяца
			Иначе
				КонецПериода = ГраницаПериодов - 1; // C 1-го по 22-е число отчетного месяца
			КонецЕсли;
			
		ИначеЕсли ОписаниеСтроки.ЭтоАгентскийНДФЛ И КонецДня(Объект.Дата) = КонецГода(Объект.Дата) Тогда
			
			НачалоПериода = НачалоПериода + 22 * 86400; // С 23-го декабря до конца года
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеСтроки.НачалоПериода = НачалоПериода;
	ОписаниеСтроки.КонецПериода  = КонецПериода;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПорядокУплатыАвансовПоНалогуНаПрибыль(Организация, Период)
	
	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату(
		"НастройкиУчетаНалогаНаПрибыль", Организация, Период, Ложь);
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУчетнойПолитики, "ПорядокУплатыАвансовПоНалогуНаПрибыль");
	
КонецФункции

#КонецОбласти
